# TypeBinding Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
TypeBinding Constructor
TypeBinding Class See Also
---
Constructs an empty type binding.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TypeBinding()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TypeBinding()
```

# Remarks
Categories can be set a later time by using the Categories property of this object.
# See Also
TypeBinding Class
TypeBinding Overload
Autodesk.Revit.DB Namespace